Examinator/src/Catalogs/ВидыМероприятийСУО/ВидыМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыМероприятийСУО</name>
  <predefined>
    <items>
      <name>НаОсновеЭлектронногоРесурса</name>
      <description>Электронное обучение</description>
    </items>
  </predefined>
  <attributes>
    <name>Общее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Электронное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПреподаватель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершаетУчащийся</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПрогрессЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйБаллЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФайловДляЗавершенияУчастником</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьУчащимсяПрикреплятьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗапланированного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветАктивного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗавершенного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветОтмененного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестированияПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОтветыВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОценкуВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытьДоступКМатериаламПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданияПроверяютсяВыборочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПодробныеСведенияОЗадании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИзученияЭлектронныхКурсов</name>
    <type>
      <types>EnumRef.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТекущуюОценку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодчиненное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбязательныеСвойстваУчастников</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ДокументыТребующиеПерепроведенияСУО/ДокументыТребующиеПерепроведенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыТребующиеПерепроведенияСУО</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Catalogs/ВидыМероприятийСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Если Общее И Электронное Тогда
		
		Текст = НСтр("ru = 'Флажок ""Используются электронные задания"" не может быть установлена для общего обучения'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;
		
	Если НЕ Общее И НЕ Электронное И ВыставляетсяОценка И НЕ ТребуетсяПреподаватель Тогда
		
		Текст = НСтр("ru = 'Установите флажок ""Требуется преподаватель"". Выставить оценку за подобное обучение сможет только преподаватель'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;
	
	Если НЕ ТребуетсяПреподаватель И НЕ ЗавершатьАвтоматически И НЕ ЗавершаетУчащийся Тогда
		
		Текст = НСтр("ru = 'Если не требуется преподаватель, то установите флажок ""Завершать автоматически"" или ""Завершает участник""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;	
	
	Если НЕ ТребуетсяПреподаватель И ЗаданияПроверяютсяВыборочно Тогда
		
		Текст = НСтр("ru = 'Если не требуется преподаватель, то снимите флажок ""Задания проверяются выборочно""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;
	
	Если ЗавершаетУчащийся И ЗавершатьАвтоматически Тогда
		
		Текст = НСтр("ru = 'Нельзя одновременно установить флажки ""Завершать автоматически"" и ""Завершает участник""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;	
	
	Если ЗавершатьАвтоматически И НЕ Электронное И НЕ Общее Тогда
		
		Текст = НСтр("ru = 'Нельзя установить флажок ""Завершать автоматически"", если не установлен флажок ""Используются электронные задания""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);			
		
	КонецЕсли;	
		
	Если ЗавершаетУчащийся И ЗначениеЗаполнено(МинимальныйПрогрессЗавершенияУчащимся) И НЕ Электронное Тогда
		
		Текст = НСтр("ru = 'Нельзя указать ""Минимальный прогресс"", если не установлен флажок ""Используются электронные задания""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);		
		
	КонецЕсли;
	
	Если ЗавершаетУчащийся И ЗначениеЗаполнено(МинимальныйБаллЗавершенияУчащимся) И НЕ Электронное Тогда
		
		Текст = НСтр("ru = ''Нельзя указать ""Минимальный балл"", если не установлен флажок ""Используются электронные задания""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);		
		
	КонецЕсли;
	
	
	Если КоличествоФайловДляЗавершенияУчастником > 0 И НЕ РазрешитьУчащимсяПрикреплятьФайлы Тогда
		
		Текст = НСтр("ru = 'Нельзя указать ""Количество файлов"", если не установлен флажок ""Разрешить прикреплять файлы""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);		
		
	КонецЕсли;
		
	Если Электронное И РазрешитьУчащимсяПрикреплятьФайлы Тогда
		Текст = НСтр("ru = 'Нельзя установить флажок ""Разрешить прикреплять файлы"", если установлен флажок ""Используются электронные задания"". Обучающийся сможет прикреплять файлы к заданиям, а не к обучению в целом'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);				
	КонецЕсли;	
	
	Если НЕ Электронное И ПоказыватьПодробныеСведенияОЗадании Тогда
		Текст = НСтр("ru = 'Нельзя установить флажок ""Показывать подробные сведения о задании"", если не установлен флажок ""Используются электронные задания""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);				
	КонецЕсли;	
	
	Если НЕ ВыставляетсяОценка И ПоказыватьТекущуюОценку Тогда
		Текст = НСтр("ru = 'Нельзя установить флажок ""Показывать текущую оценку"", если не установлен флажок ""Выставляется оценка""'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭтотОбъект, "Документ_ПрохождениеОбученияСУО");
	// Конец СтандартныеПодсистемы.Свойства
	
	Если НЕ ВыставляетсяОценка Тогда
		ШкалаОценки = Неопределено;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ИзмениласьШкалаОценки", Ложь);
	
	Если НЕ Ссылка.Пустая() Тогда
		СтараяШкала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ШкалаОценки");
		Если СтараяШкала <> ШкалаОценки Тогда
			ДополнительныеСвойства.Вставить("ИзмениласьШкалаОценки", Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ИзмениласьШкалаОценки")
		И ДополнительныеСвойства.ИзмениласьШкалаОценки Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеОбученияСУО.Ссылка
			|ИЗ
			|	Документ.ПроведениеОбученияСУО КАК ПроведениеОбученияСУО
			|ГДЕ
			|	ПроведениеОбученияСУО.Проведен = &Проведен
			|	И ПроведениеОбученияСУО.ВидОбучения = &ВидОбучения";
		
		Запрос.УстановитьПараметр("ВидОбучения", Ссылка);
		Запрос.УстановитьПараметр("Проведен", Истина);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи,,Истина,2); // Для обновления шкал
		
	КонецЕсли;
		
КонецПроцедуры


#КонецЕсли
